* Settings by Luka Lazarek

https://llazarek.com/2018/07/improving-the-agenda.html

#+begin_src emacs-lisp :tangle no
(defun ll/org/agenda/color-headers-with (tag col)
  "Color agenda lines matching TAG with color COL."
  (interactive)
  (goto-char (point-min))
  (while (re-search-forward tag nil t)
    (unless (find-in-line "\\[#[A-Z]\\]")
      (let ((todo-end (or (ll/org/agenda/find-todo-word-end)
                          (point-at-bol)))
            (tags-beginning (or (find-in-line " :" t)
                                (point-at-eol))))
        (add-text-properties todo-end
                             tags-beginning
                             `(face (:foreground ,col)))))))

;; Helper definitions
(setq ll/org/agenda-todo-words
      '("PROJECT"))
(defun find-in-line (PROJECT &optional beginning count)
  "Find the position of the start of PROJECT in the current line.
  If BEGINNING is non-nil, find the beginning of PROJECT in the current
  line. If COUNT is non-nil, find the COUNT'th occurrence from the left."
  (save-excursion
    (beginning-of-line)
    (let ((found (re-search-forward PROJECT (point-at-eol) t count)))
      (if beginning
          (match-beginning 0)
        found))))
(defun ll/org/agenda/find-todo-word-end ()
  (reduce (lambda (a b) (or a b))
          (mapcar #'find-in-line ll/org/agenda-todo-words)))


(defun ll/org/colorize-headings ()
  ;; Color all headings with :pers: #F5f5f5 #Dcdcdc #D3d3d3 #A9a9a9 #696969 #586e75  #657b83 #839496 #93a1a1 #268bd2 (tan originalmente;  #A9a9a9 alternativa)
  (ll/org/agenda/color-headers-with "PROJECT" "#268bd2"))
  ;; and :work: blue
  ;; (ll/org/agenda/color-headers-with ":work:" "blue"))
(add-hook 'org-agenda-finalize-hook #'ll/org/colorize-headings)
#+end_src

#+RESULTS:
| ll/org/colorize-headings |


** Use org-mode tables and structures in emails and elsewhere

I love the way that org-mode allows you to add simple clean structures to your text, with lists and tables. You can get some of that functionality in other modes by using
orgstruct-mode and orgtbl-mode, which are part of org-mode. 

Enable these minor modes in any major mode for one-off use with M-x orgstruct++-mode or M-x orgtbl-mode and you can use the normal org-mode commands to create lists and
tables. I find this especially useful in emails, so I use this code in my emacs config file to automatically enable these for message-mode 

DGM: already under [[id:48af1742-2872-4dbc-8f3d-ff8940e64c39][Org functionality in compose buffer]]  in the =mu4e.org= file. 

#+begin_src emacs-lisp :tangle no
  ;; use org structures and tables in message mode
  ;;(add-hook 'message-mode-hook 'turn-on-orgtbl)
  ;;(add-hook 'message-mode-hook 'turn-on-orgstruct++)
#+end_src

#+RESULTS:
| turn-on-orgstruct++ | turn-on-orgtbl | org-contacts-setup-completion-at-point |

* Org-contacts

2 jun 2020: this package has dissappeared.

#+begin_src emacs-lisp :tangle no
  (use-package org-contacts
    :ensure nil
    :after org
    :custom
    (org-contacts-files '("/home/dgm/Dropbox/gtd/contacts.org")))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24278 34649 321489 403000) :init (24278 34649 321451 454000) :init-secs (0 0 102037 207000) :use-package-secs (0 0 102263 96000)))

* Save all org buffers...
... at 1 minute before the hour:

#+begin_src emacs-lisp :tangle no
(run-at-time "00:59" 3600 'org-save-all-org-buffers)
#+end_src

#+RESULTS:
: [nil 24003 24132 0 3600 org-save-all-org-buffers nil nil 0]

* Org-pdfview (obsolete but rescued back): links to PDF documents

See https://emacs.stackexchange.com/questions/19686/how-to-use-pdf-tools-pdf-view-mode-in-emacs to open everything with =pdf-tools= in emacs

Out of the box, org-mode doesn't know about pdf-tools. However, you can add support for opening org links to pdf files with org-pdfview, which is available as a package on MELPA. Once it's installed, you can activate it with the following code in your .emacs:

21 august 2020: org-pdfview is not found any more in =list-packages= because it is rendered obsolete. But I have downloaded the =.el= file here: https://github.com/markus1189/org-pdfview/blob/master/org-pdfview.el

Thanks to this, my links to pdf's, and to certain pages within the pdf's, work.

#+begin_src emacs-lisp :tangle no
(require 'org-pdfview)
  
(add-hook 'org-mode-hook
           '(lambda ()
            (delete '("\\.pdf\\'" . default) org-file-apps)
            (add-to-list 'org-file-apps '("\\.pdf\\'" . "org-pdfview-open %s"))))

(eval-after-load "org"
  '(progn
     (setcdr (assoc "\\.pdf\\'" org-file-apps) "org-pdfview-open %s")))
#+end_src

#+RESULTS:
: org-pdfview-open %s

Original (DGM tweaked it on 13 April 2020)

#+BEGIN_EXAMPLE
(add-to-list 'org-file-apps 
             '("\\.pdf\\'" . (lambda (file link)
                                     (org-pdfview-open link))))
#+END_EXAMPLE

Example from =org-file-apps=

#+BEGIN_EXAMPLE
("pdf" . "evince %s")
#+END_EXAMPLE


Doing this will provide a new completion target for adding links via =C-c C-l=, pdfview:, with support for jumping to specific pages. Full links use the format:

=[[pdfview:/path/to/myfile.pdf::42][My file Description]]=

** org-ql

- https://github.com/alphapapa/org-ql

org-ql is a lispy query language for Org files. It allows you to find Org entries matching certain criteria and return a list of them or perform actions on them. Commands are also provided which display matching results.

(2 jun 2020: dissappeared)

#+begin_src emacs-lisp :tangle no
  (require 'org-ql)

  (use-package org-ql)
  ;;  :quelpa (org-ql :fetcher github :repo "alphapapa/org-ql"))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23960 47870 865728 276000) :init (23960 47870 865703 945000) :config (23960 47870 865411 131000) :config-secs (0 0 13 882000) :init-secs (0 0 738 217000) :use-package-secs (0 0 935 669000)))

** COMMENT Use Emacs bookmarks for fast navigation
:PROPERTIES:
:CUSTOM_ID: BookmarksFastNavigation
:END:

I've started using emacs bookmarks to save a location and return to it easily.
Normally I want to get back to my currently clocking task and that's easy - just hit =F11=.
When I'm working down a long checklist I find it convenient to set a bookmark on the next
item to check, then go away and work on it, and return to the checkbox to mark it done.

I use Emacs bookmarks for this setup as follows:

DGM: no me convencio' cuando lo use'. Better to save mark.

#+begin_src emacs-lisp :tangle no
  ;; Bookmark handling
  ;;
  (global-set-key (kbd "s--") '(lambda () (interactive) (bookmark-set "SAVED")))
  (global-set-key (kbd "s-_") '(lambda () (interactive) (bookmark-jump "SAVED")))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (bookmark-jump SAVED) |

When I want to save the current location I just hit =C-f6= and then I
can return to it with =f6= anytime.  I overwrite the same bookmark
each time I set a new position.

** NEXT is for tasks
:PROPERTIES:
:CUSTOM_ID: NextTasks
:END:
[2012-03-04 Sun 12:41]

=NEXT= keywords are for *tasks* and not *projects*.  I've added a
function to the todo state change hook and clock in hook so that any
parent tasks marked =NEXT= automagically change from =NEXT= to =TODO=
since they are now projects and not tasks.

#+begin_src emacs-lisp :tangle no
  (defun bh/mark-next-parent-tasks-todo ()
    "Visit each parent task and change NEXT states to TODO"
    (let ((mystate (or (and (fboundp 'org-state)
                            state)
                       (nth 2 (org-heading-components)))))
      (when mystate
        (save-excursion
          (while (org-up-heading-safe)
            (when (member (nth 2 (org-heading-components)) (list "NEXT"))
              (org-todo "TODO")))))))

  (add-hook 'org-after-todo-state-change-hook 'bh/mark-next-parent-tasks-todo 'append)
  (add-hook 'org-clock-in-hook 'bh/mark-next-parent-tasks-todo 'append)
#+end_src

#+RESULTS:
| bh/mark-next-parent-tasks-todo |

** Preserving source block indentation
:PROPERTIES:
:CUSTOM_ID: PreserveSourceIndentations
:END:
I do not preserve indentation for source blocks mainly because this doesn't look
nice with indented org-files.  The only reason I've found to preserve indentation is
when TABs in files need to be preserved (e.g. Makefiles).  I don't normally edit
these files in org-mode so I leave this setting turned off.

I've changed the default block indentation so that it is not indented
from the text in the org file.  This allows editing source blocks in 
place without requiring use of =C-c '= so that code lines up correctly.

#+begin_src emacs-lisp :tangle no
  (setq org-src-preserve-indentation nil)
  (setq org-edit-src-contentqq-indentation 0)
#+end_src

#+RESULTS:
: 0

** Keep clock durations in hours
:PROPERTIES:
:CUSTOM_ID: ClockDurationsNoDays
:END:
[2013-02-17 Sun 12:37]

The default for clock durations has changed to include days which is
24 hours.  At work I like to think of a day as 6 hours of work (the
rest of the time is lost in meetings and other overhead on average) so
displaying clock durations in days doesn't make sense to me.

The following setting displays clock durations (from =C-c C-x C-d= in
hours and minutes.

#+begin_src emacs-lisp :tangle no
  (setq org-time-clocksum-format
        '(:hours "%d" :require-hours t :minutes ":%02d" :require-minutes t))
#+end_src

#+RESULTS:
| :hours | %d | :require-hours | t | :minutes | :%02d | :require-minutes | t |


*** Automatic Hourly Commits
:PROPERTIES:
:CUSTOM_ID: HourlyCommits
:END:

My Emacs setup saves all org buffers at 1 minute before the hour using
the following code in my =.emacs=

DGM changes this to saving all org buffers every fifteen minutes so that changes in GTD are recorded constantly.

#+begin_src emacs-lisp :tangle no
;; (run-at-time "00:59" 3600 'org-save-all-org-buffers)
(run-at-time nil (* 15 60) 'org-save-all-org-buffers)
#+end_src

#+RESULTS:
: [nil 24012 63008 61123 900 org-save-all-org-buffers nil nil 772000]

A =cron= job runs at the top of the hour to commit any changes just
saved by the call to =org-save-all-org-buffers= above.  I use a script
to create the commits so that I can run it on demand to easily commit
all modified work when moving from one machine to another.

=crontab= details:
#+begin_example 
0 * * * * ~/bin/org-git-sync.s
h >/dev/null
#+end_example

DGM change: I have made it to run every minute with =crontab -e=:
#+begin_example 
,* * * * * ~/bin/org-git-sync.sh >/dev/null
#+end_example

**** COMMENT DGM adds saving Org buffers every minute

You may wish to call `recentf-save-list` periodically, e.g. every 5 minutes:
(originally disabled because I found it too invasive).

#+BEGIN_SRC emacs-lisp :tangle no
(run-at-time nil 60 'org-save-all-org-buffers)
#+END_SRC

#+RESULTS:
: [nil 24006 30951 345509 60 org-save-all-org-buffers nil nil 104000]

** Automatically change list bullets
:PROPERTIES:
:CUSTOM_ID: ListBullets
:END:

I take point-form notes during meetings.  Having the same list bullet
for every list level makes it hard to read the details when lists are
indented more than 3 levels.

Org-mode has a way to automatically change the list bullets when you
change list levels.

| Current List Bullet | Next indented list bullet |
|---------------------+---------------------------|
| +                   | -                         |
| *                   | -                         |
| 1.                  | -                         |
| 1)                  | -                         |
| A)                  | -                         |
| B)                  | -                         |
| a)                  | -                         |
| b)                  | -                         |
| A.                  | -                         |
| B.                  | -                         |
| a.                  | -                         |
| b.                  | -                         |

#+begin_src emacs-lisp :tangle no
  (setq org-list-demote-modify-bullet (quote (("-" . "+")
                                              ("+" . "*")
                                              ("*" . "-")
                                              ("1." . "-")
                                              ("1)" . "-")
                                              ("A)" . "-")
                                              ("B)" . "-")
                                              ("a)" . "-")
                                              ("b)" . "-")
                                              ("A." . "-")
                                              ("B." . "-")
                                              ("a." . "-")
                                              ("b." . "-"))))
#+end_src

#+RESULTS:
: ((- . +) (+ . *) (* . -) (1. . -) (1) . -) (A) . -) (B) . -) (a) . -) (b) . -) (A. . -) (B. . -) (a. . -) (b. . -))

** Providing progress reports to others

When someone wants details of what I've done recently I simple generate a
log report in the agenda with tasks I've completed and state changes combined
with a clock report for the appropriate time period.

The following setting shows closed tasks and state changes in the
agenda.  Combined with the agenda clock report ('R') I can quickly
generate all of the details required.

#+begin_src emacs-lisp :tangle no
  ;; Agenda log mode items to display (closed and state changes by default)
  (setq org-agenda-log-mode-items (quote (closed state)))
#+end_src

#+RESULTS:
| closed | state |

To generate the report I pull up the agenda for the appropriate time frame
(today, yesterday, this week, or last week) and hit the key sequence
=l R= to add the log report (without clocking data lines) and the agenda clock
report at the end.

Then it's simply a matter of exporting the resulting agenda in some useful format
to provide to other people.  =C-x C-w /tmp/agenda.html RET= exports to HTML
and =C-x C-w /tmp/agenda.txt RET= exports to plain text.  Other formats are 
available but I use these two the most.

Combining this export with tag filters and =C-u R= can limit the
report to exactly the tags that people are interested in.

*** Preventing things from falling through the cracks

This helps me keep track of unscheduled tasks, because I sometimes
forget to assign tasks a date. I also want to keep track of stuck projects.

DGM: I don't find this function... ahh, it's not interactive!

#+begin_src emacs-lisp :tangle no
  (defun my/org-agenda-list-unscheduled (&rest ignore)
    "Create agenda view for tasks that are unscheduled and not done."
    (let* ((org-agenda-todo-ignore-with-date t)
           (org-agenda-overriding-header "List of unscheduled tasks: "))
      (org-agenda-get-todos)))
  (setq org-stuck-projects
        '("+PROJECT-MAYBE-DONE"
          ("TODO")
          nil
          "\\<IGNORE\\>"))
#+end_src

#+RESULTS:
| +PROJECT-MAYBE-DONE | (TODO) | nil | \<IGNORE\> |

*** Track time

I use the clock a lot, says Sacha. Okay, but I think =I= in agenda does this.

#+BEGIN_SRC emacs-lisp :tangle no
  (with-eval-after-load 'org-agenda
    (bind-key "i" 'org-agenda-clock-in org-agenda-mode-map))
#+END_SRC

#+RESULTS:
: org-agenda-clock-in


#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23951 38814 686101 588000) :init (23951 38814 686064 64000) :config (23951 38814 685671 345000) :config-secs (0 0 924 872000) :init-secs (0 0 2300 743000) :use-package-secs (0 0 2834 977000)))

Too many clock entries clutter up a heading.

#+begin_src emacs-lisp :tangle no
  (setq org-log-into-drawer "LOGBOOK")
  (setq org-clock-into-drawer t)
#+end_src

#+RESULTS:
: 1

*** =writequit= customization of org-clock
- https://writequit.org/denver-emacs/presentations/2017-04-11-time-clocking-with-org.html

My agenda org clock report settings show 6 levels of detail with links to the tasks. I like wider reports than the default compact setting so I override the :narrow value. 

Read: https://orgmode.org/manual/The-clock-table.html
Org mode can produce quite complex reports based on the time clocking information. Such a report is called a clock table, because it is formatted as one or several Org tables.

NB: I could try with =:block today=? Objective: to show only time spent today.

#+begin_src emacs-lisp :tangle no
  ;; Agenda clock report parameters
  (setq org-agenda-clockreport-parameter-plist
        '(:link t :maxlevel 6 :fileskip0 t :compact t :narrow 80 :score 0))
#+end_src

#+RESULTS:
| :link | t | :maxlevel | 6 | :block | today | :fileskip0 | t | :compact | t | :narrow | 60 | :score | 0 |
==here

TODO: understand what =:score 0= does.

**** Effort estimation

Then, you can hit =C-c C-x e= on a headline and be prompted for the "quick" efforts. So C-c C-x e 3 would select 45 minutes. 
#+begin_src emacs-lisp :tangle no
  ;; global Effort estimate values
  ;; (setq org-global-properties
  ;;      '(("Effort_ALL" .
  ;;         "0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 0:00")))
  ;;        1    2    3    4    5    6    7    8    9    0
  ;; These are the hotkeys ^^

  (setq org-global-properties (quote (("Effort_ALL" . "0:05 0:10 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 0:00")
                                      ("STYLE_ALL" . "habit"))))
#+end_src

#+RESULTS:
: ((Effort_ALL . 0:05 0:10 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 0:00) (STYLE_ALL . habit))

***** Column-view from the agenda
It can be quite useful to use column view also from the agenda, where entries are collected by certain criteria.
The first headline is now a row of browsable columns displaying properties. The first highlighted line of the buffer briefly tells you what property is displayed in each columns. 

We need to define some columns to see, I like to define mine as the task, then the priority, the effort, and finally the sum of time taken for the task: 

={:}= means: display a summary (total) of effort field, by adding all the time values found in the property "Effort".

When the column view in the agenda shows the CLOCKSUM_T, that is always today’s clocked time for this item. So even in the weekly agenda, the clocksum listed in column view only originates from today. This lets you compare the time you spent on a task for today, with the time already spent —via CLOCKSUM—and with the planned total effort for it. (info from: https://orgmode.org/manual/Agenda-column-view.html)

When the column view in the agenda shows the CLOCKSUM, that is always the entire clocked time for this item. So even in the daily/weekly agenda, the clocksum listed in column view may originate from times outside the current view. This has the advantage that you can compare these values with a column listing the planned total effort for a task—one of the major applications for column view in the agenda.

If you want information about clocked time in the displayed period use clock table mode (press R in the agenda).

DGM: =%2PRIORITY= deleted (originally between context and state), as I don't use priorities.

#+begin_src emacs-lisp :tangle no
  ;; Set default column view headings: Task Priority Effort Clock_Summary
  (setq org-columns-default-format "%50ITEM(Task) %15TAGS(Context) %7TODO(State) %20SCHEDULED(Scheduled) %6Effort(Effort){:} %CLOCKSUM_T(Tday'sHrs){:} %CLOCKSUM(TotalHrs){:}")  
#+end_src

#+RESULTS:
: %50ITEM(Task) %15TAGS(Context) %7TODO(State) %20SCHEDULED(Scheduled) %6Effort(Effort){:} %CLOCKSUM_T(Tday'sHrs){:} %CLOCKSUM(TotalHrs){:}

You can now turn on org-columns with =C-c C-x C-c=, you should see something like the following screenshots. =q= to quit.

Also, you can move to the "Effort" column and hit 0-9 to fast-choose the amount of effort for a task also, instead of adding effort to each individual headline one at a time. 

*** Overlaps

From: http://doc.norang.ca/org-mode.html

#+begin_src emacs-lisp :tangle no
  (setq org-agenda-clock-consistency-checks
        (quote (:max-duration "4:00"
                              :min-duration 0
                              :max-gap 0
                              :gap-ok-around ("4:00"))))
#+end_src

#+RESULTS:
| :max-duration | 4:00 | :min-duration | 0 | :max-gap | 0 | :gap-ok-around | (4:00) |

** Public holidays 

Public holidays in Spain. Tip from: https://www.emacswiki.org/emacs/CalendarLocalization
And Calendario de fiestas moviles hasta 2100 en http://www.antonioburgos.com/antologia/semana_santa/curiosidades/zzcurioaalmaque.html
Check another cool customization here: http://www.gnomon.org.uk/diary.html

#+BEGIN_SRC emacs-lisp :tangle no
  (require 'org-agenda)
  (require 'holidays)
  (setq calendar-holidays holiday-other-holidays)
  (setq org-agenda-include-diary t)  ;; Thanks to this, the holidays below show up in my computer's Org Agenda view  (though not in orgzly).

  ;; (setq holiday-other-holidays  ;; with this holidays don't show up in agenda.
  ;; with the following holidays show up in org-agenda but still it does not show up in orgzly so watch out! 
  (setq calendar-holidays  ;; holiday-other-holidays          
        '((holiday-fixed 1 1 "Año Nuevo / New Year's Day")
          (holiday-fixed 1 6 "Día de Reyes / Epiphany") 
          (holiday-fixed 2 14 "Valentine's Day")
          ;;          (holiday-fixed 3 5 "Martes de Carnaval")
          ;;          (holiday-fixed 3 6 "Miércoles de Ceniza")
          (holiday-easter-etc -47 "Martes de Carnaval / Shrove Tuesday") 
          (holiday-easter-etc -46 "Miércoles de Ceniza / Ash Friday")
          ;; (holiday-sexp '(calendar-nth-named-day 1 1 3 year 19) "Día de San José") ;; en 2020 este esta mal
          (holiday-easter-etc -7 "Domingo de Ramos / Palm Sunday")
          (holiday-easter-etc -3 "Jueves Santo / Maundy Thursday")
          (holiday-easter-etc -2 "Viernes Santo / Good Friday")
          (holiday-easter-etc 0 "Domingo de Resurrección o Pascua / Easter Sunday")
          (holiday-easter-etc +1 "Lunes de Pascua")
          (holiday-fixed 5 1 "Día Internacional del Trabajo")
          (holiday-fixed 5 2 "Día de la Comunidad de Madrid")
          (holiday-fixed 5 6 "Día de la Madre")
          (holiday-fixed 5 15 "Día de San Isidro")
          (holiday-fixed 5 31 "Corpus Christi (Madrid)")
          ;;  (holiday-easter-etc +43 "Día de la Ascención")
          ;;  (holiday-easter-etc +64 "Corpus Christi")
          (holiday-easter-etc 60 "Corpus Christi") ;; en http://lists.gnu.org/archive/html/emacs-devel/2004-07/msg00494.html
          (holiday-fixed 10 12 "Día de la Hispanidad")
          (holiday-fixed 11 1  "Todos los santos")
          (holiday-fixed 11 9  "Día de la Almudena")
          (holiday-fixed 12 25 "Natividad del Señor")
          (holiday-fixed 12 6 "Día de la Constitución")
          (holiday-fixed 12 8 "Inmaculada Concepción") ;; en 2018. En 2019 se trasladará al lunes 9. Ojo! Cambiar con el nuevo agno!!
          ))
#+END_SRC

#+RESULTS:
| holiday-fixed      |   1 |                                                1 | Año Nuevo / New Year's Day    |
| holiday-fixed      |   1 |                                                6 | Día de Reyes / Epiphany       |
| holiday-fixed      |   2 |                                               14 | Valentine's Day               |
| holiday-easter-etc | -47 |              Martes de Carnaval / Shrove Tuesday |                               |
| holiday-easter-etc | -46 |                 Miércoles de Ceniza / Ash Friday |                               |
| holiday-easter-etc |  -7 |                   Domingo de Ramos / Palm Sunday |                               |
| holiday-easter-etc |  -3 |                   Jueves Santo / Maundy Thursday |                               |
| holiday-easter-etc |  -2 |                      Viernes Santo / Good Friday |                               |
| holiday-easter-etc |   0 | Domingo de Resurrección o Pascua / Easter Sunday |                               |
| holiday-easter-etc |   1 |                                  Lunes de Pascua |                               |
| holiday-fixed      |   5 |                                                1 | Día Internacional del Trabajo |
| holiday-fixed      |   5 |                                                2 | Día de la Comunidad de Madrid |
| holiday-fixed      |   5 |                                                6 | Día de la Madre               |
| holiday-fixed      |   5 |                                               15 | Día de San Isidro             |
| holiday-fixed      |   5 |                                               31 | Corpus Christi (Madrid)       |
| holiday-easter-etc |  60 |                                   Corpus Christi |                               |
| holiday-fixed      |  10 |                                               12 | Día de la Hispanidad          |
| holiday-fixed      |  11 |                                                1 | Todos los santos              |
| holiday-fixed      |  11 |                                                9 | Día de la Almudena            |
| holiday-fixed      |  12 |                                               25 | Natividad del Señor           |
| holiday-fixed      |  12 |                                                6 | Día de la Constitución        |
| holiday-fixed      |  12 |                                                8 | Inmaculada Concepción         |



Basically you tell agenda to display events from calendar diary:

(Tip from https://emacs.stackexchange.com/questions/10965/easiest-way-to-customize-holidays-that-appear-in-org-agenda.)

(already included earlier)

#+BEGIN_SRC emacs-lisp :tangle no
  '(org-agenda-include-diary t) 
#+END_SRC


*** Make calendar start on Monday instead of Sunday

#+BEGIN_SRC emacs-lisp :tangle no
  (setq calendar-week-start-day 1)
#+END_SRC

#+RESULTS:
: 1

** Refiling

From Caolan at https://caolan.org/dotfiles/emacs.html#orgd96aeb0. 

Provide refile targets as paths, so a level 3 headline will be available as level1/level2/level3. Offer completions in hierarchical steps.

Explanation: 

Take for example =("/home/dgm/Dropbox/gtd/tickler.org" :level . 2)=. This gave lots of low level headings but not the overall =tickler= heading. So if I wanted to refile something to this upper-level heading I could not. 

When I changed this to =("/home/dgm/Dropbox/gtd/tickler.org" :maxlevel . 2)= I got it working for low-level headings and for the upper-level heading =tickler=.s

Similarly, nota que sólo con =maxlevel= I get the refiling to =someday.org='s second level---two stars---to work.


#+BEGIN_SRC emacs-lisp :tangle no
  ;; setq org-refile-targets
    (custom-set-variables
     '(org-refile-targets '(("/home/dgm/Dropbox/gtd/gtd.org" :maxlevel . 2)
                               ("/media/dgm/blue/documents/proyectos/mtj/mtj_gtd.org" :level . 2)
                               ("/media/dgm/blue/documents/proyectos/laBussola/laBussola_gtd.org" :level . 2)
                               ("/media/dgm/blue/documents/proyectos/iat_methods/iat_methods.org" :level . 2)
                               ("/media/dgm/blue/documents/proyectos/mutual-stata/gtd/mutual_gtd.org" :maxlevel . 2)
                               ("/media/dgm/blue/documents/proyectos/caixa2019-bartik/gtd/bartik-gtd.org" :maxlevel . 2)
                               ("/media/dgm/blue/documents/proyectos/curso-ayuntamiento-madrid/gtd/curso-disenoInvestigacionI.org" :maxlevel . 2)
                               ("/media/dgm/blue/documents/My-Academic-Stuff/acreditacion-titular/gtd/titularidad-gtd.org" :maxlevel . 2)
                               ("/home/dgm/Dropbox/gtd/divorcio_gtd.org" :level . 2)
                               ("/home/dgm/Dropbox/gtd/someday.org" :maxlevel . 2)
                               ("/home/dgm/Dropbox/gtd/inbox.org" :maxlevel . 1)
                               ("/home/dgm/Dropbox/gtd/notes.org" :maxlevel . 2)
                               ("/home/dgm/Dropbox/gtd/habits.org" :maxlevel . 2)
                               ("/home/dgm/Dropbox/gtd/tickler.org" :maxlevel . 2))))
#+END_SRC

#+RESULTS:

New from https://www.reddit.com/r/emacs/comments/4366f9/how_do_orgrefiletargets_work/

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-refile-targets '((nil :maxlevel . 9)
                             (org-agenda-files :maxlevel . 9)))
#+END_SRC

#+RESULTS:
: ((nil :maxlevel . 9) (org-agenda-files :maxlevel . 9))

This first element of org-refile-targets decides the heading levels to consider within current file, the second element - within other agenda files. (https://stackoverflow.com/questions/22200312/refile-from-one-file-to-other)

Create any missing parent nodes during refile (after asking for confirmation). (From Caolan at  https://caolan.org/dotfiles/emacs.html#orgd96aeb0.)

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-refile-allow-creating-parent-nodes 'confirm)
#+END_SRC

#+RESULTS:
: confirm

The last two variables are useful because I'm using =helm=. Instead of having to step through the headings =Foo=, =Bar=, and =Go to the the Store=, I just get a giant list of targets in the form =Foo/Bar/Go to the Store=. Makes it super easy to jump to whatever I'm looking for.

From: https://www.reddit.com/r/emacs/comments/4366f9/how_do_orgrefiletargets_work/

Also, https://emacs.stackexchange.com/questions/32617/how-to-jump-directly-to-an-org-headline
notes that "Users of completion packages like ido/ivy/helm will probably want to change the following setting in order to see the whole target path at once:"

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-refile-use-outline-path t)          ;; show full paths to refiling
  (setq org-outline-path-complete-in-steps nil) ;; Change to nil to refile in a single go.
#+END_SRC

#+RESULTS:

* Ido =Imenu='s depth of search

Depth of search for =Imenu= in Org buffers. From https://www.reddit.com/r/emacs/comments/8v6fny/how_to_change_the_depth_of_imenulist_for_org_files/

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-imenu-depth 5)
#+END_SRC

#+RESULTS:
: 5

* Font-lock

DGM sets this to nil trying to get the minimum decoration available to speed things up.

Note: moved to =dgm.org=

#+BEGIN_SRC emacs-lisp :tangle no
;; (setq font-lock-maximum-decoration nil)
        
(setq font-lock-maximum-decoration        
        '((org-mode . 1)))

;; (setq org-src-font-lock-fontify-block nil)
#+End_SRC

#+RESULTS:
: ((org-mode . 1))

** Public holidays 

Public holidays in Spain. Tip from: https://www.emacswiki.org/emacs/CalendarLocalization
And Calendario de fiestas moviles hasta 2100 en http://www.antonioburgos.com/antologia/semana_santa/curiosidades/zzcurioaalmaque.html
Check another cool customization here: http://www.gnomon.org.uk/diary.html

#+BEGIN_SRC emacs-lisp :tangle no
  (require 'org-agenda)
  (require 'holidays)
  (setq calendar-holidays holiday-other-holidays)
  (setq org-agenda-include-diary t)  ;; Thanks to this, the holidays below show up in my computer's Org Agenda view  (though not in orgzly).

  ;; (setq holiday-other-holidays  ;; with this holidays don't show up in agenda.
  ;; with the following holidays show up in org-agenda but still it does not show up in orgzly so watch out! 
  (setq calendar-holidays  ;; holiday-other-holidays          
        '((holiday-fixed 1 1 "Año Nuevo / New Year's Day")
          (holiday-fixed 1 6 "Día de Reyes / Epiphany") 
          (holiday-fixed 2 14 "Valentine's Day")
          ;;          (holiday-fixed 3 5 "Martes de Carnaval")
          ;;          (holiday-fixed 3 6 "Miércoles de Ceniza")
          (holiday-easter-etc -47 "Martes de Carnaval / Shrove Tuesday") 
          (holiday-easter-etc -46 "Miércoles de Ceniza / Ash Friday")
          ;; (holiday-sexp '(calendar-nth-named-day 1 1 3 year 19) "Día de San José") ;; en 2020 este esta mal
          (holiday-easter-etc -7 "Domingo de Ramos / Palm Sunday")
          (holiday-easter-etc -3 "Jueves Santo / Maundy Thursday")
          (holiday-easter-etc -2 "Viernes Santo / Good Friday")
          (holiday-easter-etc 0 "Domingo de Resurrección o Pascua / Easter Sunday")
          (holiday-easter-etc +1 "Lunes de Pascua")
          (holiday-fixed 5 1 "Día Internacional del Trabajo")
          (holiday-fixed 5 2 "Día de la Comunidad de Madrid")
          (holiday-fixed 5 6 "Día de la Madre")
          (holiday-fixed 5 15 "Día de San Isidro")
          (holiday-fixed 5 31 "Corpus Christi (Madrid)")
          ;;  (holiday-easter-etc +43 "Día de la Ascención")
          ;;  (holiday-easter-etc +64 "Corpus Christi")
          (holiday-easter-etc 60 "Corpus Christi") ;; en http://lists.gnu.org/archive/html/emacs-devel/2004-07/msg00494.html
          (holiday-fixed 10 12 "Día de la Hispanidad")
          (holiday-fixed 11 1  "Todos los santos")
          (holiday-fixed 11 9  "Día de la Almudena")
          (holiday-fixed 12 25 "Natividad del Señor")
          (holiday-fixed 12 6 "Día de la Constitución")
          (holiday-fixed 12 8 "Inmaculada Concepción") ;; en 2018. En 2019 se trasladará al lunes 9. Ojo! Cambiar con el nuevo agno!!
          ))
#+END_SRC

#+RESULTS:
| holiday-fixed      |   1 |                                                1 | Año Nuevo / New Year's Day    |
| holiday-fixed      |   1 |                                                6 | Día de Reyes / Epiphany       |
| holiday-fixed      |   2 |                                               14 | Valentine's Day               |
| holiday-easter-etc | -47 |              Martes de Carnaval / Shrove Tuesday |                               |
| holiday-easter-etc | -46 |                 Miércoles de Ceniza / Ash Friday |                               |
| holiday-easter-etc |  -7 |                   Domingo de Ramos / Palm Sunday |                               |
| holiday-easter-etc |  -3 |                   Jueves Santo / Maundy Thursday |                               |
| holiday-easter-etc |  -2 |                      Viernes Santo / Good Friday |                               |
| holiday-easter-etc |   0 | Domingo de Resurrección o Pascua / Easter Sunday |                               |
| holiday-easter-etc |   1 |                                  Lunes de Pascua |                               |
| holiday-fixed      |   5 |                                                1 | Día Internacional del Trabajo |
| holiday-fixed      |   5 |                                                2 | Día de la Comunidad de Madrid |
| holiday-fixed      |   5 |                                                6 | Día de la Madre               |
| holiday-fixed      |   5 |                                               15 | Día de San Isidro             |
| holiday-fixed      |   5 |                                               31 | Corpus Christi (Madrid)       |
| holiday-easter-etc |  60 |                                   Corpus Christi |                               |
| holiday-fixed      |  10 |                                               12 | Día de la Hispanidad          |
| holiday-fixed      |  11 |                                                1 | Todos los santos              |
| holiday-fixed      |  11 |                                                9 | Día de la Almudena            |
| holiday-fixed      |  12 |                                               25 | Natividad del Señor           |
| holiday-fixed      |  12 |                                                6 | Día de la Constitución        |
| holiday-fixed      |  12 |                                                8 | Inmaculada Concepción         |



Basically you tell agenda to display events from calendar diary:

(Tip from https://emacs.stackexchange.com/questions/10965/easiest-way-to-customize-holidays-that-appear-in-org-agenda.)

(already included earlier)

#+BEGIN_SRC emacs-lisp :tangle no
  '(org-agenda-include-diary t) 
#+END_SRC


*** Make calendar start on Monday instead of Sunday

#+BEGIN_SRC emacs-lisp :tangle no
  (setq calendar-week-start-day 1)
#+END_SRC

#+RESULTS:
: 1

** Refiling

From Caolan at https://caolan.org/dotfiles/emacs.html#orgd96aeb0. 

Provide refile targets as paths, so a level 3 headline will be available as level1/level2/level3. Offer completions in hierarchical steps.

Explanation: 

Take for example =("/home/dgm/Dropbox/gtd/tickler.org" :level . 2)=. This gave lots of low level headings but not the overall =tickler= heading. So if I wanted to refile something to this upper-level heading I could not. 

When I changed this to =("/home/dgm/Dropbox/gtd/tickler.org" :maxlevel . 2)= I got it working for low-level headings and for the upper-level heading =tickler=.s

Similarly, nota que sólo con =maxlevel= I get the refiling to =someday.org='s second level---two stars---to work.


#+BEGIN_SRC emacs-lisp :tangle no
  ;; setq org-refile-targets
    (custom-set-variables
     '(org-refile-targets '(("/home/dgm/Dropbox/gtd/gtd.org" :maxlevel . 2)
                               ("/media/dgm/blue/documents/proyectos/mtj/mtj_gtd.org" :level . 2)
                               ("/media/dgm/blue/documents/proyectos/laBussola/laBussola_gtd.org" :level . 2)
                               ("/media/dgm/blue/documents/proyectos/iat_methods/iat_methods.org" :level . 2)
                               ("/media/dgm/blue/documents/proyectos/mutual-stata/gtd/mutual_gtd.org" :maxlevel . 2)
                               ("/media/dgm/blue/documents/proyectos/caixa2019-bartik/gtd/bartik-gtd.org" :maxlevel . 2)
                               ("/media/dgm/blue/documents/proyectos/curso-ayuntamiento-madrid/gtd/curso-disenoInvestigacionI.org" :maxlevel . 2)
                               ("/media/dgm/blue/documents/My-Academic-Stuff/acreditacion-titular/gtd/titularidad-gtd.org" :maxlevel . 2)
                               ("/home/dgm/Dropbox/gtd/divorcio_gtd.org" :level . 2)
                               ("/home/dgm/Dropbox/gtd/someday.org" :maxlevel . 2)
                               ("/home/dgm/Dropbox/gtd/inbox.org" :maxlevel . 1)
                               ("/home/dgm/Dropbox/gtd/notes.org" :maxlevel . 2)
                               ("/home/dgm/Dropbox/gtd/habits.org" :maxlevel . 2)
                               ("/home/dgm/Dropbox/gtd/tickler.org" :maxlevel . 2))))
#+END_SRC

#+RESULTS:

New from https://www.reddit.com/r/emacs/comments/4366f9/how_do_orgrefiletargets_work/

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-refile-targets '((nil :maxlevel . 9)
                             (org-agenda-files :maxlevel . 9)))
#+END_SRC

#+RESULTS:
: ((nil :maxlevel . 9) (org-agenda-files :maxlevel . 9))

This first element of org-refile-targets decides the heading levels to consider within current file, the second element - within other agenda files. (https://stackoverflow.com/questions/22200312/refile-from-one-file-to-other)

Create any missing parent nodes during refile (after asking for confirmation). (From Caolan at  https://caolan.org/dotfiles/emacs.html#orgd96aeb0.)

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-refile-allow-creating-parent-nodes 'confirm)
#+END_SRC

#+RESULTS:
: confirm

The last two variables are useful because I'm using =helm=. Instead of having to step through the headings =Foo=, =Bar=, and =Go to the the Store=, I just get a giant list of targets in the form =Foo/Bar/Go to the Store=. Makes it super easy to jump to whatever I'm looking for.

From: https://www.reddit.com/r/emacs/comments/4366f9/how_do_orgrefiletargets_work/

Also, https://emacs.stackexchange.com/questions/32617/how-to-jump-directly-to-an-org-headline
notes that "Users of completion packages like ido/ivy/helm will probably want to change the following setting in order to see the whole target path at once:"

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-refile-use-outline-path t)          ;; show full paths to refiling
  (setq org-outline-path-complete-in-steps nil) ;; Change to nil to refile in a single go.
#+END_SRC

#+RESULTS:

* Ido =Imenu='s depth of search

Depth of search for =Imenu= in Org buffers. From https://www.reddit.com/r/emacs/comments/8v6fny/how_to_change_the_depth_of_imenulist_for_org_files/

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-imenu-depth 5)
#+END_SRC

#+RESULTS:
: 5

* Font-lock

DGM sets this to nil trying to get the minimum decoration available to speed things up.

Note: moved to =dgm.org=

#+BEGIN_SRC emacs-lisp :tangle no
;; (setq font-lock-maximum-decoration nil)
        
(setq font-lock-maximum-decoration        
        '((org-mode . 1)))

;; (setq org-src-font-lock-fontify-block nil)
#+End_SRC

#+RESULTS:
: ((org-mode . 1))

*** Estimating WPM
:PROPERTIES:
:ID:       f5bae513-1704-4417-93b9-a770d6b93253
:END:

I'm curious about how fast I type some things.

How to use it: clock in in an Org heading. Type as much as you like. When you clock out, call the function and you'll see your stats. 

#+begin_src emacs-lisp :tangle no
(require 'org-clock)
(defun sacha/org-entry-wpm ()
  (interactive)
  (save-restriction
    (save-excursion
      (org-narrow-to-subtree)
      (goto-char (point-min))
      (let* ((words (count-words-region (point-min) (point-max)))
	     (minutes (org-clock-sum-current-item))
	     (wpm (/ words minutes)))
	(message "WPM: %d (words: %d, minutes: %d)" wpm words minutes)
	(kill-new (number-to-string wpm))))))
  
(defun sacha/timer-go ()
  "Quick keyboard timer."
  (interactive)
  (insert "GO\n")
  (run-with-timer 3 nil (lambda () (insert "\n")))  ; for warmup
  (run-with-timer 15 nil (lambda () ; 12 seconds + the 3-second warmup
                           (let ((col (- (point) (line-beginning-position))))
                             (insert (format " | %d | \n" col)))
                           )))
;;(local-set-key (kbd "<f7>") 'sacha/timer-go)
#+end_src


#+RESULTS:
: sacha/timer-go

Set to the name of the file where new notes will be stored

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-mobile-inbox-for-pull "/media/dgm/blue/documents/dropbox/org/fromMobile.org")
#+END_SRC

#+RESULTS:
: /media/dgm/blue/documents/dropbox/org/fromMobile.org


* Globally defined tags

Tip from: https://orgmode.org/manual/Setting-tags.html

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-tag-alist '((:startgroup)
                        ("@errands"  . ?e)
                        ("@home"     . ?h)
                        ("@uned"     . ?u)
                        (:endgroup)
                        ("project"   . ?p)
                        ("browsing"  . ?b)
                        ("drill"     . ?d)
                        ("habit"     . ?a)
                        ("laptop"    . ?l)
                        ("mailing"   . ?m)
                        ("ordenador" . ?o)
                        ("reading"   . ?r)
                        ("salud"     . ?s)
                        ("tel"       . ?t)
                        ("writing"   . ?w)
                        ("FLAGGED"   . ??)))
#+END_SRC

#+RESULTS:
: ((:startgroup) (@errands . 101) (@home . 104) (@uned . 117) (:endgroup) (project . 112) (browsing . 98) (drill . 100) (habit . 97) (laptop . 108) (mailing . 109) (ordenador . 111) (reading . 114) (salud . 115) (tel . 116) (writing . 119) (FLAGGED . 63))

*** Archive Settings
Where archived projects and tasks go.
#+source: orgmode-archive
#+begin_src emacs-lisp :tangle no
  (setq org-archive-location "/home/dgm/Dropbox/gtd/archive.org::From %s")
#+end_src

#+RESULTS: orgmode-archive
: /home/dgm/Dropbox/gtd/archive.org::From %s

** Ensure the Latest Org-mode manual is in the info directory

By placing the =doc/= directory in Org-mode at the front of the
=Info-directory-list= we can be sure that the latest version of the
Org-mode manual is available to the =info= command (bound to =C-h i=).

#+begin_src emacs-lisp :tangle no
  (unless (boundp 'Info-directory-list)
    (setq Info-directory-list Info-default-directory-list))
  (setq Info-directory-list
        (cons (expand-file-name
               "doc"
               (expand-file-name
                "org"
                (expand-file-name "src" dotfiles-dir)))
              Info-directory-list))
#+end_src

#+RESULTS:
| /home/dgm/.emacs.d/src/org/doc | /home/dgm/.emacs.d/src/org/doc | /home/dgm/.emacs.d/src/org/doc | /home/dgm/.emacs.d/elpa/chess-2.0.4 | /home/dgm/.emacs.d/elpa/auctex-12.2.0 | /home/dgm/.emacs.d/elpa/ebib-20191205.1336 | /home/dgm/.emacs.d/elpa/editorconfig-20191127.529 | /home/dgm/.emacs.d/elpa/ess-smart-underscore-20190309.101 | /home/dgm/.emacs.d/elpa/ess-20191130.2000 | /home/dgm/.emacs.d/elpa/ghub-20191205.1648 | /home/dgm/.emacs.d/elpa/ledger-mode-20191126.2029 | /home/dgm/.emacs.d/elpa/magit-20191128.1802 | /home/dgm/.emacs.d/elpa/org-plus-contrib-20191203 | /home/dgm/.emacs.d/elpa/org-ql-20191203.221 | /home/dgm/.emacs.d/elpa/org-super-agenda-20191130.2245 | /home/dgm/.emacs.d/elpa/pandoc-mode-20191003.1221 | /home/dgm/.emacs.d/elpa/racket-mode-20191204.205 | /home/dgm/.emacs.d/elpa/transient-20191206.1306 | /home/dgm/.emacs.d/elpa/use-package-20191126.2034 | /home/dgm/.emacs.d/elpa/with-editor-20191105.2250 | /home/dgm/.emacs.d/elpa/ivy-20191128.1153 | /usr/local/share/info/ | /usr/share/info/ | /usr/local/share/info/ |


** Nice Bulleted Lists

- From Miskatonic's setup: [[file:/media/dgm/blue/documents/programming/emacs/CoolEmacsGuys/miskatonic/.emacs.d/setup/setup-orgmode.el::;;;;%20org-bullets%20(https://github.com/sabof/org-bullets)][Miskatonic!]]
Possibilities include:  ◉ ○ ✸ ✿ ♥ ● ◇ ✚ ✜ ☯ ◆ ♠ ♣ ♦ ☢ ❀ ◆ ◖ ▶ ► • ★ ▸ or any other Unicode character

Default is '("◉" "○" "✸" "✿")

I've used ("◉" "○ ""►" "•" "•"))

#+name: org-bullets
#+begin_src emacs-lisp :tangle no
  (use-package org-bullets
    :defer t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))
#+end_src

#+RESULTS: org-bullets
: t

Going back to list of stars.
#+begin_src emacs-lisp :tangle no
(use-package org-bullets
  :config
  (setq org-bullets-bullet-list '("⊢" "⋮" "⋱" "⋱" "⋱"))
  :init
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  )
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23978 12595 960157 264000) :init (23978 12595 960102 53000) :config (23978 12595 959712 522000) :config-secs (0 0 1000 376000) :init-secs (0 0 2335 74000) :use-package-secs (0 0 2702 479000)))

** More customization

Disable line splitting on M-RET.

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-M-RET-may-split-line '((default)))
#+END_SRC

#+RESULTS:
| default |

Replace ellipsis with ellipsis in brackets

#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-ellipsis " […]")
#+END_SRC

#+RESULTS:
:  […]

DGM: now I like Miskatonic's setup better: 
 - Change the ellipsis that indicates hidden content
 - http://endlessparentheses.com/changing-the-org-mode-ellipsis.html

#+begin_src emacs-lisp :tangle no
(setq org-ellipsis " ⤵") ;; ⤵ ↴ ⬎ ⤷ ⬎
(set-face-attribute 'org-ellipsis nil :underline nil)
#+end_src

#+RESULTS:

Indentation.
#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-adapt-indentation nil)
#+END_SRC

#+RESULTS:


** Org-Mode Hooks
Make yasnippet work properly with org-mode.

#+begin_src emacs-lisp :tangle no
  ;;  (defun yas/org-very-safe-expand ()
  ;;    (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))

  (defun yas-org-very-safe-expand ()
    (let ((yas-fallback-behavior 'return-nil))
      (and (fboundp 'yas-expand) (yas-expand))))

  (add-hook 'org-mode-hook
            (lambda ()
              (add-to-list 'org-tab-first-hook
                           'yas-org-very-safe-expand)
              ))
#+end_src

#+RESULTS:
| (lambda nil (highlight-symbol-mode)) | org-table-stripes-enable | org-mode-reftex-setup | org-ref-org-menu | (lambda nil (org-bullets-mode)) | turn-off-auto-fill | ambrevar/turn-off-indent-tabs | ambrevar/turn-off-linum | (lambda nil (visual-line-mode 1)) | org-indent-mode | (lambda nil (set-face-attribute 'org-level-1 nil :height 1.5) (set-face-attribute 'org-level-2 nil :height 1.2) (set-face-attribute 'org-level-3 nil :height 1.1) (set-face-attribute 'org-level-4 nil :height 1.1) (set-face-attribute 'org-level-5 nil :height 1.1)) | (lambda nil (local-set-key \216 'outline-next-visible-heading) (local-set-key \220 'outline-previous-visible-heading) (local-set-key \225 'outline-up-heading) (local-set-key \227 'org-table-copy-region) (local-set-key \231 'org-table-paste-rectangle) (local-set-key \214 'org-table-sort-lines) (local-set-key \311 'org-toggle-iimage-in-org)) | (lambda nil (add-to-list 'org-tab-first-hook 'yas-org-very-safe-expand)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |

#+begin_src emacs-lisp :tangle no
  (add-hook 'org-mode-hook
            (lambda ()
              (local-set-key "\M-\C-n" 'outline-next-visible-heading)
              (local-set-key "\M-\C-p" 'outline-previous-visible-heading)
              (local-set-key "\M-\C-u" 'outline-up-heading)
              ;; table
              (local-set-key "\M-\C-w" 'org-table-copy-region)
              (local-set-key "\M-\C-y" 'org-table-paste-rectangle)
              (local-set-key "\M-\C-l" 'org-table-sort-lines)                
              ;; display images
              (local-set-key "\M-I" 'org-toggle-iimage-in-org)
              ;;(local-set-key "<M-up>" 'org-move-item-up)
              ;;(local-set-key "<M-down>" 'org-move-item-down)
              ;; yasnippet (using the new org-cycle hooks)
              ;;(make-variable-buffer-local 'yas/trigger-key)
              ;;(setq yas/trigger-key [tab])
              ;;(add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
              ;;(define-key yas/keymap [tab] 'yas/next-field)
              ))
#+end_src


Original hook from =dgm.org=

#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'org-mode-hook
            (lambda ()
              (set-face-attribute 'org-level-1 nil :height 1.5)
              (set-face-attribute 'org-level-2 nil :height 1.2)
              (set-face-attribute 'org-level-3 nil :height 1.1)
              (set-face-attribute 'org-level-4 nil :height 1.1)
              (set-face-attribute 'org-level-5 nil :height 1.1)))
#+END_SRC



** Code blocks
This activates a number of widely used languages, you are encouraged
to activate more languages using the customize interface for the
=org-babel-load-languages= variable, or with an elisp form like the
one below.  The customize interface of =org-babel-load-languages=
contains an up to date list of the currently supported languages.

DGM 30 dic 2018: tangle no as I've moved this to =-stats.org=.

#+begin_src emacs-lisp :tangle no
  (require 'ob-stata)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (R . t)
     (perl . t)
     (ruby . t)
     (python . t)
     (js . t)
     (haskell . t)
     (stata . t)
     (shell . t)
     (ledger . t)
     (latex . t)
     ))

  ;; (sh . t)
  ;; (scheme . t)


  ;; I am following Ista Zahn here: don't include (stata . t) but do (require 'ob-stata) afterwards. Stil, when I do so, I get the Debugger entered--Lisp error: (void-variable inferior-STA-program-name)
  ;; eval(inferior-STA-program-name) so the problem comes from =ob-stata=.
#+end_src

#+RESULTS:

The next block makes org-babel aware that a lower-case 'r' in a =src= block header should be processed as R. 

#+source: add-r
#+begin_src emacs-lisp :tangle no
  (add-to-list 'org-src-lang-modes
               '("r" . ess-mode))

  (add-to-list 'org-src-lang-modes
               '("stata" . ess-mode))
#+end_src

#+RESULTS: add-r
: ((stata . ess-mode) (r . ess-mode) (ocaml . tuareg) (elisp . emacs-lisp) (ditaa . artist) (asymptote . asy) (dot . fundamental) (sqlite . sql) (calc . fundamental) (C . c) (cpp . c++) (C++ . c++) (screen . shell-script) (shell . sh) (bash . sh))


**** Another approach
Suggested here: https://www.reddit.com/r/emacs/comments/ek37ri/i_cant_get_indentation_to_work_orgmode/

#+begin_src emacs-lisp :tangle yes

  (use-package org-indent
    :after org
    :ensure nil
    :init
    (add-hook 'org-mode-hook 'org-indent-mode))

#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24608 9060 637537 56000) :init (24608 9060 637491 391000) :config (24608 9060 636936 230000) :config-secs (0 0 12 834000) :init-secs (0 0 27330 325000) :use-package-secs (0 0 27490 465000)))

** Org-Mode Hooks
Make yasnippet work properly with org-mode.

#+begin_src emacs-lisp :tangle no
  ;;  (defun yas/org-very-safe-expand ()
  ;;    (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))

  (defun yas-org-very-safe-expand ()
    (let ((yas-fallback-behavior 'return-nil))
      (and (fboundp 'yas-expand) (yas-expand))))

  (add-hook 'org-mode-hook
            (lambda ()
              (add-to-list 'org-tab-first-hook
                           'yas-org-very-safe-expand)
              ))
#+end_src

#+RESULTS:
| (lambda nil (highlight-symbol-mode)) | org-table-stripes-enable | org-mode-reftex-setup | org-ref-org-menu | (lambda nil (org-bullets-mode)) | turn-off-auto-fill | ambrevar/turn-off-indent-tabs | ambrevar/turn-off-linum | (lambda nil (visual-line-mode 1)) | org-indent-mode | (lambda nil (set-face-attribute 'org-level-1 nil :height 1.5) (set-face-attribute 'org-level-2 nil :height 1.2) (set-face-attribute 'org-level-3 nil :height 1.1) (set-face-attribute 'org-level-4 nil :height 1.1) (set-face-attribute 'org-level-5 nil :height 1.1)) | (lambda nil (local-set-key \216 'outline-next-visible-heading) (local-set-key \220 'outline-previous-visible-heading) (local-set-key \225 'outline-up-heading) (local-set-key \227 'org-table-copy-region) (local-set-key \231 'org-table-paste-rectangle) (local-set-key \214 'org-table-sort-lines) (local-set-key \311 'org-toggle-iimage-in-org)) | (lambda nil (add-to-list 'org-tab-first-hook 'yas-org-very-safe-expand)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |

#+begin_src emacs-lisp :tangle no
  (add-hook 'org-mode-hook
            (lambda ()
              (local-set-key "\M-\C-n" 'outline-next-visible-heading)
              (local-set-key "\M-\C-p" 'outline-previous-visible-heading)
              (local-set-key "\M-\C-u" 'outline-up-heading)
              ;; table
              (local-set-key "\M-\C-w" 'org-table-copy-region)
              (local-set-key "\M-\C-y" 'org-table-paste-rectangle)
              (local-set-key "\M-\C-l" 'org-table-sort-lines)                
              ;; display images
              (local-set-key "\M-I" 'org-toggle-iimage-in-org)
              ;;(local-set-key "<M-up>" 'org-move-item-up)
              ;;(local-set-key "<M-down>" 'org-move-item-down)
              ;; yasnippet (using the new org-cycle hooks)
              ;;(make-variable-buffer-local 'yas/trigger-key)
              ;;(setq yas/trigger-key [tab])
              ;;(add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
              ;;(define-key yas/keymap [tab] 'yas/next-field)
              ))
#+end_src


Original hook from =dgm.org=

#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'org-mode-hook
            (lambda ()
              (set-face-attribute 'org-level-1 nil :height 1.5)
              (set-face-attribute 'org-level-2 nil :height 1.2)
              (set-face-attribute 'org-level-3 nil :height 1.1)
              (set-face-attribute 'org-level-4 nil :height 1.1)
              (set-face-attribute 'org-level-5 nil :height 1.1)))
#+END_SRC


*** From https://people.umass.edu/weikaichen/post/emacs-academic-tools/

Added on 21 March 2020. 
#+begin_src emacs-lisp :tangle no
(setq bibtex-completion-format-citation-functions
      '((org-mode      . bibtex-completion-format-citation-org-link-to-PDF)
        (latex-mode    . bibtex-completion-format-citation-cite)
        (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
        (default       . bibtex-completion-format-citation-default)))
#+end_src

#+RESULTS:
: ((org-mode . bibtex-completion-format-citation-org-link-to-PDF) (latex-mode . bibtex-completion-format-citation-cite) (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc) (default . bibtex-completion-format-citation-default))

*** From https://people.umass.edu/weikaichen/post/emacs-academic-tools/

Added on 21 March 2020. 
#+begin_src emacs-lisp :tangle no
(setq bibtex-completion-format-citation-functions
      '((org-mode      . bibtex-completion-format-citation-org-link-to-PDF)
        (latex-mode    . bibtex-completion-format-citation-cite)
        (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
        (default       . bibtex-completion-format-citation-default)))
#+end_src

#+RESULTS:
: ((org-mode . bibtex-completion-format-citation-org-link-to-PDF) (latex-mode . bibtex-completion-format-citation-cite) (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc) (default . bibtex-completion-format-citation-default))

** COMMENT Daniel Mai's costumization

DGM comments this out: I don't trust D. Mai much now! 

From https://github.com/danielmai/.emacs.d/blob/master/config.org

DGM comments out second line in case it is related to the function  =org-do-latex-and-related= that is slowing so much my emacs
DGM is about scaling inline images in Emacs and I still have to understand what it is about.

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (setq org-image-actual-width 550)
  ;; (setq org-highlight-latex-and-related '(latex script entities))
#+END_SRC

#+RESULTS:
| latex | script | entities |

*** Org tags

The default value is -77, which is weird for smaller width windows. I’d rather have the tags align horizontally with the header. 45 is a good column number to do that.

#+BEGIN_SRC emacs-lisp :tangle no
;;  (setq org-tags-column 45)
#+END_SRC

#+RESULTS:
: 45

* COMMENT eBib package 
DGM: Lo he comentado porque me parecía muy agresivo.
(10 Jan 2021)

=ebib= is a bibtex database manager that works inside emacs. It can
talk to org-mode. See [[http://ebib.sourceforge.net/][the ebib project page]] for more. When Ebib is
loaded, you can run it with =M-x ebib=.
  
Package required by tufte-org-mode (https://github.com/tsdye/tufte-org-mode).

Ebib is a BibTeX database manager that runs in GNU Emacs.  With Ebib, you
can create and manage .bib-files, all within Emacs.  It supports @String
and @Preamble definitions, multi-line field values, searching, and
integration with Emacs' (La)TeX mode, Org mode and others.

See the Ebib manual for usage and installation instructions.

The latest release version of Ebib, contact information and mailing list
can be found at <http://joostkremers.github.io/ebib>.  Development
sources can be found at <https://github.com/joostkremers/ebib>.


Original code on =bib=

#+BEGIN_EXAMPLE
,#+source: ebib-load
,#+begin_src emacs-lisp :tangle yes
(autoload 'ebib "ebib" "Ebib, a BibTeX database manager." t)
(setq ebib-preload-bib-files 
'("/media/dgm/blue/documents/bibs/socbib.bib"))
(add-hook 'LaTeX-mode-hook #'(lambda ()
(local-set-key "\C-c v" 'ebib-insert-bibtex-key)))
,#+end_src

,#+RESULTS: ebib-load
| er/add-latex-mode-expansions | TeX-PDF-mode | (lambda nil (local-set-key  v 'ebib-insert-bibtex-key)) | turn-on-reftex |
#+END_EXAMPLE

#+begin_src emacs-lisp :tangle no

  (use-package ebib
    :ensure t
    :preface
    (use-package parsebib)
    :custom
    ;; (ebib-preload-bib-files '("/media/dgm/blue/documents/bibs/socbib.bib"))
    ;; (ebib-bib-search-dirs '("/media/dgm/blue/documents/bibs"))
    (ebib-use-timestamp t)
    (ebib-timestamp-format "%d.%m.%Y."))

  ;; (setq ebib-bibtex-dialect 'biblatex) ;; already set earlier

  ;;(add-hook 'LaTeX-mode-hook #'(lambda ()
  ;;        (local-set-key "\C-c v" 'ebib-insert-bibtex-key)))

#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24571 15572 55092 833000) :preface (24571 15572 55086 753000) :init (24571 15572 55080 137000) :config (24571 15572 54968 276000) :config-secs (0 0 1197 149000) :init-secs (0 0 1432 460000) :preface-secs (0 0 1930 438000) :use-package-secs (0 0 2049 145000)))


** ebib and citation settings in =org-mode=

=ebib= is a bibtex database manager that works inside emacs. It can
talk to org-mode. See [[http://orgmode.org/worg/org-tutorials/org-latex-export.html#sec-17_2][this Worg tutorial]] for details.

#+source: ebib-setup
#+begin_src emacs-lisp :tangle no
  (org-add-link-type "ebib" 'ebib)

  (org-add-link-type
   "cite" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "cite:" desc)))
           (format "\\cite{%s}" path)
         (format "\\cite[%s]{%s}" desc path)
         )))))

  (org-add-link-type
   "parencite" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "parencite:" desc)))
           (format "\\parencite{%s}" path)
         (format "\\parencite[%s]{%s}" desc path)
         )))))

  (org-add-link-type
   "textcite" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "textcite:" desc)))
           (format "\\textcite{%s}" path)
         (format "\\textcite[%s]{%s}" desc path)
         )))))

  (org-add-link-type
   "autocite" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "autocite:" desc)))
           (format "\\autocite{%s}" path)
         (format "\\autocite[%s]{%s}" desc path)
         )))))

  (org-add-link-type
   "footcite" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "footcite:" desc)))
           (format "\\footcite{%s}" path)
         (format "\\footcite[%s]{%s}" desc path)
         )))))

  (org-add-link-type
   "fullcite" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "fullcite:" desc)))
           (format "\\fullcite{%s}" path)
         (format "\\fullcite[%s]{%s}" desc path)
         )))))

  (org-add-link-type
   "citetitle" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "citetitle:" desc)))
           (format "\\citetitle{%s}" path)
         (format "\\citetitle[%s]{%s}" desc path)
         )))))

  (org-add-link-type
   "citetitles" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "citetitles:" desc)))
           (format "\\citetitles{%s}" path)
         (format "\\citetitles[%s]{%s}" desc path)
         )))))

  (org-add-link-type
   "headlessfullcite" 'ebib
   (lambda (path desc format)
     (cond
      ((eq format 'latex)
       (if (or (not desc) (equal 0 (search "headlessfullcite:" desc)))
           (format "\\headlessfullcite{%s}" path)
         (format "\\headlessfullcite[%s]{%s}" desc path)
         )))))
#+end_src

#+RESULTS: ebib-setup
: Created headlessfullcite link.



    (org-add-link-type
     "cite" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "cite:" desc)))
             (format "\\cite{%s}" path)
           (format "\\cite[%s]{%s}" desc path)
           )))))

    (org-add-link-type
     "parencite" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "parencite:" desc)))
             (format "\\parencite{%s}" path)
           (format "\\parencite[%s]{%s}" desc path)
           )))))

    (org-add-link-type
     "textcite" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "textcite:" desc)))
             (format "\\textcite{%s}" path)
           (format "\\textcite[%s]{%s}" desc path)
           )))))

    (org-add-link-type
     "autocite" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "autocite:" desc)))
             (format "\\autocite{%s}" path)
           (format "\\autocite[%s]{%s}" desc path)
           )))))

    (org-add-link-type
     "footcite" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "footcite:" desc)))
             (format "\\footcite{%s}" path)
           (format "\\footcite[%s]{%s}" desc path)
           )))))

    (org-add-link-type
     "fullcite" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "fullcite:" desc)))
             (format "\\fullcite{%s}" path)
           (format "\\fullcite[%s]{%s}" desc path)
           )))))

    (org-add-link-type
     "citetitle" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "citetitle:" desc)))
             (format "\\citetitle{%s}" path)
           (format "\\citetitle[%s]{%s}" desc path)
           )))))

    (org-add-link-type
     "citetitles" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "citetitles:" desc)))
             (format "\\citetitles{%s}" path)
           (format "\\citetitles[%s]{%s}" desc path)
           )))))

    (org-add-link-type
     "headlessfullcite" 'ebib
     (lambda (path desc format)
       (cond
        ((eq format 'latex)
         (if (or (not desc) (equal 0 (search "headlessfullcite:" desc)))
             (format "\\headlessfullcite{%s}" path)
           (format "\\headlessfullcite[%s]{%s}" desc path)
           )))))
*** Get =org-ref= to work with =textcite= citations
From: https://lists.gnu.org/archive/html/emacs-orgmode/2014-05/msg00527.html

#+begin_src emacs-lisp :tangle no
(org-ref-define-citation-link "textcite" ?I)
#+end_src

#+RESULTS:
: ((73 . textcite:%l) (73 . textcite:%l))

*** COMMENT Org Super Agenda
- https://github.com/alphapapa/org-super-agenda/issues/51
- http://bnbeckwith.com/bnb-emacs/#orga483373

#+begin_src emacs-lisp :tangle yes
  (setq org-agenda-block-separator "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━")
#+end_src

#+RESULTS:
: ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━


** COMMENT Examples by Alphapapa

#+begin_src emacs-lisp :tangle yes
  (use-package org-super-agenda
    :quelpa (org-super-agenda :fetcher github :repo "alphapapa/org-super-agenda")
    :config
    (org-super-agenda-mode t))

  (setq org-super-agenda-groups
        '((:name "Next Items"
                 :time-grid t
                 :habit t
                 :tag ("NEXT"))
          (:name "Projects"
                 :children t
                 :todo ("NEXT" "TODO" "WAITING")
                 :order 1)
          ))

#+end_src

#+RESULTS:
| :name | Next Items | :time-grid | t | :habit | t                   | :tag   | (NEXT) |
| :name | Projects   | :children  | t | :todo  | (NEXT TODO WAITING) | :order |      1 |

#+begin_src emacs-lisp :tangle no
  ;; Reset everything to nil
  (setq org-agenda-custom-commands nil)

  (use-package org-super-agenda
    :defer t
    :quelpa (org-super-agenda :fetcher github :repo "alphapapa/org-super-agenda")
    :config
    (org-super-agenda-mode t))

  (setq org-agenda-custom-commands
        '(("z" "Super zaen view"
           ((agenda "" ((org-agenda-span 'day)
                        (org-super-agenda-groups
                         '((:name "Today"
                                  :time-grid t
                                  :date today
                                  :todo "TODAY"
                                  :scheduled today
                                  :order 1)
                           (:name "Quick Picks"
                                  :effort <= "0:30")
                           ))
                        )))
           (alltodo "" ((org-agenda-overriding-header "")
                        (org-super-agenda-groups
                         '((:name "Next to do"
                                  :todo "NEXT"
                                  :order 1)
                           (:name "Waiting"
                                  :todo "WAITING"
                                  :order 20)
                           (:name "Due Today"
                                  :deadline today
                                  :order 2)
                           (:name "Due Soon"
                                  :deadline future
                                  :order 8)
                           (:name "Overdue"
                                  :deadline past
                                  :order 7)
                           (:name "Projects"
                                  :tag "project"
                                  :order 14)
                           ;; (:discard (:tag ("Chore" "Routine" "Daily")))
                           ))))))))

#+end_src

#+RESULTS:
| z | Super zaen view | ((agenda  ((org-agenda-span 'day) (org-super-agenda-groups '((:name Today :time-grid t :date today :todo TODAY :scheduled today :order 1) (:name Quick Picks :effort <= 0:30)))))) | (alltodo  ((org-agenda-overriding-header ) (org-super-agenda-groups '((:name Next to do :todo NEXT :order 1) (:name Waiting :todo WAITING :order 20) (:name Due Today :deadline today :order 2) (:name Due Soon :deadline future :order 8) (:name Overdue :deadline past :order 7) (:name Projects :tag project :order 14))))) |

**** COMMENT Views 
The key to knowing what work there is the agenda views. These provide a landscape to list, filter or manipulate tasks. org-agenda-custom-commands defines which views are available by default.

First, I define a little helper function (from Sacha Chua) to display a note with agenda.

#+begin_src emacs-lisp :tangle yes
  (defun bnb/org-agenda-with-tip (arg)
    (org-agenda-list arg)
    (let ((inhibit-read-only t)
          (pos (point)))
      (goto-char (pnnoint-max))
      (goto-char pos)))
#+end_src

#+RESULTS:
: bnb/org-agenda-with-tip

WIP from: https://github.com/fniessen/emacs-leuven/blob/master/org-custom-agenda-views.el

#+begin_src emacs-lisp :tangle yes
  ;; Reset everything to nil
  (setq org-agenda-custom-commands nil)

  (add-to-list 'org-agenda-custom-commands
               '("b" "Agenda" bnb/org-agenda-with-tip))

  (add-to-list 'org-agenda-custom-commands
               '("c" . "COLLECT...") t)

  (add-to-list 'org-agenda-custom-commands
               '("cb" "CollectBox"
                 ((alltodo ""))))

  (add-to-list 'org-agenda-custom-commands
               '("f" . "FOCUS...") t)

  (add-to-list 'org-agenda-custom-commands
               `("f." "Today"
                 ((agenda ""
                          ((org-agenda-entry-types '(:timestamp :sexp))
                           (org-agenda-overriding-header
                            (concat "CALENDAR Today"
                                    (format-time-string "%a %d" (current-time))))
                           (org-agenda-span 'day)))
                  (tags-todo "LEVEL=1+REFILE"
                             ((org-agenda-overriding-header "COLLECTBOX (Unscheduled)")))
                  (tags-todo "DEADLINE=\"<+0d>\""
                             ((org-agenda-overriding-header "DUE TODAY")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'notedeadline))
                              (org-agenda-sorting-strategy '(priority-down))))
                  (tags-todo "DEADLINE<\"<+0d>\""
                             ((org-agenda-overriding-header "OVERDUE")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'notedeadline))
                              (org-agenda-sorting-strategy '(priority-down))))
                  (agenda ""
                          ((org-agenda-entry-types '(:scheduled))
                           (org-agenda-overriding-header "SCHEDULED")
                           (org-agenda-skip-function
                            '(org-agenda-skip-entry-if 'todo 'done))
                           (org-agenda-sorting-strategy
                            '(priority-down time-down))
                           (org-agenda-span 'day)
                           (org-agenda-start-on-weekday nil)
                           (org-agenda-time-grid nil)))
                  (todo "DONE"
                        ((org-agenda-overriding-header "COMPLETED"))))
                 ((org-agenda-format-date "")
                  (org-agenda-start-with-clockreport-mode nil))) t)

  (add-to-list 'org-agenda-custom-commands
               '("fh" "Hotlist"
                 ((tags-todo "DEADLINE<\"<+0d>\""
                             ((org-agenda-overriding-header "OVERDUE")))
                  (tags-todo "DEADLINE>=\"<+0d>\"+DEADLINE<=\"<+1w>\""
                             ((org-agenda-overriding-header "DUE IN NEXT 7 DAYS")))
                  (tags-todo "DEADLINE=\"\"+FLAGGED|DEADLINE>\"<+1w>\"+FLAGGED"
                             ((org-agenda-overriding-header "FLAGGED"))))
                 ((org-agenda-todo-ignore-scheduled 'future)))  t)

  (add-to-list 'org-agenda-custom-commands
               '("r" . "REVIEW...") t)

  (add-to-list 'org-agenda-custom-commands
               '("ra" . "All Tasks...") t)

  (add-to-list 'org-agenda-custom-commands
               '("rad" "All Tasks (grouped by Due Date)"
                 ((tags-todo "DEADLINE<\"<+0d>\""
                             ((org-agenda-overriding-header "OVERDUE")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'notdeadline))))
                  (tags-todo "DEADLINE=\"<+0d>\""
                             ((org-agenda-overriding-header "DUE TODAY")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'notdeadline))))
                  (tags-todo "DEADLINE=\"<+1d>\""
                             ((org-agenda-overriding-header "DUE TOMORROW")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'notdeadline))))
                  (tags-todo "DEADLINE>\"<+1d>\"+DEADLINE<=\"<+7d>\""
                             ((org-agenda-overriding-header "DUE WITHIN A WEEK")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'notdeadline))))
                  (tags-todo "DEADLINE>\"<+7d>\"+DEADLINE<=\"<+28d>\""
                             ((org-agenda-overriding-header "DUE WITHIN A MONTH")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'notdeadline))))
                  (tags-todo "DEADLINE>\"<+28d>\""
                             ((org-agenda-overriding-header "DUE LATER")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'notdeadline))))
                  (tags-todo "TODO={WAIT}"
                             ((org-agenda-overriding-header "WAITING FOR")
                              (org-agenda-skip-function
                               '(org-agenda-skip-entry-if 'deadline))))
                  (todo ""
                        ((org-agenda-overriding-header "WAITING FOR")
                         (org-agenda-skip-function
                          '(org-agenda-skip-entry-if 'deadline)))))
                 ((org-agenda-sorting-strategy '(priority-down))
                  (org-agenda-write-buffer-name "All Tasks (grouped by Due Date)"))
                 "~/Documents/Org/all-tasks-by-due-date.pdf") t)

  (add-to-list 'org-agenda-custom-commands
               '("ra1" "All Tasks with a due date"
                 ((alltodo ""))
                 ((org-agenda-overriding-header "All Tasks (sorted by Due Date)")
                  (org-agenda-skip-function
                   '(org-agenda-skip-entry-if 'notdeadline))
                  (org-agenda-sorting-strategy '(deadline-up)))) t)

  (add-to-list 'org-agenda-custom-commands
               '("rag" "Grouped Tasks")
               ())

  (add-to-list 'org-agenda-custom-commands
               '("rt" . "Timesheet...") t)

  ;; Show what happened today.
  (add-to-list 'org-agenda-custom-commands
               '("rtd" "Daily Timesheet"
                 ((agenda ""))
                 ((org-agenda-log-mode-items '(clock closed))
                  (org-agenda-overriding-header "DAILY TIMESHEET")
                  (org-agenda-show-log 'clockcheck)
                  (org-agenda-span 'day)
                  (org-agenda-start-with-clockreport-mode t)
                  (org-agenda-time-grid nil))) t)

  ;; Show what happened this week.
  (add-to-list 'org-agenda-custom-commands
               '("rtw" "Weekly Timesheet"
                 ((agenda ""))
                 (
                  ;; (org-agenda-format-date "")
                  (org-agenda-overriding-header "WEEKLY TIMESHEET")
                  (org-agenda-skip-function '(org-agenda-skip-entry-if 'timestamp))
                  (org-agenda-span 'week)
                  (org-agenda-start-on-weekday 1)
                  (org-agenda-start-with-clockreport-mode t)
                  (org-agenda-time-grid nil))) t)

  (add-to-list 'org-agenda-custom-commands
               '("rc" . "Calendar...") t)

  (add-to-list 'org-agenda-custom-commands
               '("rc7" "Events and appointments for 7 days"
                 ((agenda ""))
                 ((org-agenda-entry-types '(:timestamp :sexp))
                  ;; (org-agenda-overriding-header "Calendar for 7 days")
                  (org-agenda-span 'week)
                  (org-agenda-format-date "\n%a %d")
                  ;; (org-agenda-date-weekend ... new face ...)
                  (org-agenda-time-grid nil))) t)

  (add-to-list 'org-agenda-custom-commands
               '("rw" "Weekly review"
                 ((tags "CATEGORY={@REFILE}&LEVEL<=2"
                        ((org-agenda-overriding-header "NEW TASKS")))
                  (agenda ""
                          ((org-agenda-clockreport-mode t)
                           (org-agenda-format-date
                            (concat "\n"
                                    "%Y-%m-%d" " %a "
                                    (make-string (window-width) ?_)))
                           (org-agenda-overriding-header "PAST WEEK")
                           (org-agenda-prefix-format " %?-11t %i %-12:c% s")
                           (org-agenda-show-log 'clockcheck)
                           (org-agenda-span 7)
                           (org-agenda-start-day "-1w")
                           (org-deadline-warning-days 0)))
                  (agenda ""
                          ((org-agenda-overriding-header "NEXT MONTH")
                           (org-agenda-span 'month)
                           (org-agenda-start-day "+0d")
                           (org-deadline-warning-days 0)))
                  (todo "PROJECT"
                        ((org-agenda-overriding-header "PROJECT LIST")))
                  (todo "DONE|PROJECTDONE"
                        ((org-agenda-overriding-header
                          "Candidates to be archived"))))))

  (use-package org-super-agenda
    :ensure t
    :quelpa (org-super-agenda :fetcher github :repo "alphapapa/org-super-agenda")
    :config
    (org-super-agenda-mode t)
    (add-to-list 'org-agenda-custom-commands
                 '("rag" "Grouped Tasks"
                   ((todo "" ((org-super-agenda-groups
                               '((:name "All Tasks"
                                        :auto-category t))))))))
    (add-to-list 'org-agenda-custom-commands
                 '("f1" "Projects"
                   ((tags "+project" ((org-super-agenda-groups
                                       '((:name "Projects"
                                                :auto-category t
                                                :children t
                                                :todo ("NEXT" "TODO" "WAITING")
                                                :order 1))))))))
    (add-to-list 'org-agenda-custom-commands
                 '("f2" "Score 2 Tasks"
                   ((tags "+Score=2" ((org-super-agenda-groups
                                       '((:name "Score 1 Tasks" :auto-category t))))))))
    (add-to-list 'org-agenda-custom-commands
                 '("f3" "Score 3 Tasks"
                   ((tags "+Score=3" ((org-super-agenda-groups
                                       '((:name "Score 1 Tasks" :auto-category t))))))))
    (add-to-list 'org-agenda-custom-commands
                 '("f5" "Score 5 Tasks"
                   ((tags "+Score=5" ((org-super-agenda-groups
                                       '((:name "Score 1 Tasks" :auto-category t))))))))
    (add-to-list 'org-agenda-custom-commands
                 '("f8" "Score 8 Tasks"
                   ((tags "+Score=8" ((org-super-agenda-groups
                                       '((:name "Score 1 Tasks" :auto-category t)))))))))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23954 59890 535382 601000) :init (23954 59890 535343 195000) :config (23954 59890 534977 377000) :config-secs (0 0 839 245000) :init-secs (0 0 1423 687000) :use-package-secs (0 0 1750 202000)))

Phew! That is a lot of lisp! It is easiest to describe each view by the key that triggers it.

a Agenda with tip (keystroke tip)
w Tasks waiting on something
r Refile New notes and tasks
n Next Any task with the NEXT tag
A Tasks ready for Archive
u Upcoming tasks Scheduled or due in the next week.
U Unscheduled tasks
P Printable agenda Formats tasks at the top with upcoming items below.
S Scoreless tasks Use this to get the scoreless tasks and edit in column mode
h Habits
# Stuck projects
z Agenda with Personal Files
c Select default clocking task

